In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_excel(r"C:\Users\Balakrishna_Vema\Documents\Data science\Data sets\bank_market1.xlsx")

In [5]:
data

,age,balance,day,duration,campaign,pdays,previous,Unnamed: 7,Unnamed: 8
0,18,1944,10,122,3,-1,0,NaN,77795461.0
1,18,108,10,167,1,-1,0,NaN,NaN
2,18,608,12,267,1,-1,0,NaN,NaN
3,18,35,21,104,2,-1,0,NaN,NaN
4,18,5,24,143,2,-1,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
45206,93,775,22,860,2,177,7,NaN,NaN
45207,93,775,4,476,2,13,9,NaN,NaN
45208,94,1234,3,212,1,-1,0,NaN,NaN
45209,95,2282,21,207,17,-1,0,NaN,NaN
45210,95,0,1,215,1,-1,0,NaN,NaN

In [7]:
bank1 = data[data["age"]>40]

In [8]:
bank1.shape

(20494, 9)

In [9]:
data.shape

(45211, 9)

In [20]:
bank = pd.read_csv(r"C:\Users\Balakrishna_Vema\Documents\Data science\Data sets\bank_market3.csv")

In [22]:
bank.shape

(45211, 18)

In [23]:
bank.columns

Index(['Cust_num', 'age', 'job', 'marital', 'education', 'default', 'balance',
       'housing', 'loan', 'contact', 'day', 'month', 'duration', 'campaign',
       'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

In [25]:
ban2= bank[(bank["age"]>40)&(bank["marital"]=="single")]

In [26]:
ban2.shape

(2018, 18)

In [28]:
ban2.head()

,Cust_num,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
1,2,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
9,10,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown,no
16,17,45,admin.,single,unknown,no,13,yes,no,unknown,5,may,98,1,-1,0,unknown,no
28,29,46,management,single,secondary,no,-246,yes,no,unknown,5,may,255,2,-1,0,unknown,no
53,54,42,admin.,single,secondary,no,-76,yes,no,unknown,5,may,787,1,-1,0,unknown,no

In [29]:
def age_cal(age):
    if age<40:
        return "group1"
    elif age<60:
        return "group2"
    elif age<80:
        return "group3"
    else:
        return "group4"

In [31]:
bank["age_flg"] = bank["age"].apply(age_cal)

In [32]:
bank["age_flg"].value_counts()

group1    23362
group2    20065
group3     1654
group4      130
Name: age_flg, dtype: int64

In [33]:
pd.qcut(bank["age"],q=4)

0          (48.0, 95.0]
1          (39.0, 48.0]
2        (17.999, 33.0]
3          (39.0, 48.0]
4        (17.999, 33.0]
              ...
45206      (48.0, 95.0]
45207      (48.0, 95.0]
45208      (48.0, 95.0]
45209      (48.0, 95.0]
45210      (33.0, 39.0]
Name: age, Length: 45211, dtype: category
Categories (4, interval[float64]): [(17.999, 33.0] < (33.0, 39.0] < (39.0, 48.0] < (48.0, 95.0]]

In [43]:
bank["age_flg1"] = pd.qcut(bank["age"], q=4, precision=0)

In [44]:
bank["age_flg1"].value_counts()

(17.0, 33.0]    13083
(48.0, 95.0]    11188
(39.0, 48.0]    10661
(33.0, 39.0]    10279
Name: age_flg1, dtype: int64

In [48]:
bin_lable = ["group1","group2","hroup3","group4"]
bank["age_flg1"] = pd.qcut(bank["age"], q=[0,0.25,0.5,0.75,1],labels=bin_lable)

In [50]:
bank["age_flg1"].value_counts()

group1    13083
group4    11188
hroup3    10661
group2    10279
Name: age_flg1, dtype: int64

In [51]:
bank.describe(include="category")

       age_flg1
count     45211
unique        4
top      group1
freq      13083

In [52]:
bank.describe(percentiles=[0,0.2,0.4,0.6,0.8,1])

,Cust_num,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,22606.000000,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,13051.435847,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,1.000000,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
0%,1.000000,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
20%,9043.000000,32.000000,22.000000,7.000000,89.000000,1.000000,-1.000000,0.000000
40%,18085.000000,36.000000,272.000000,13.000000,147.000000,2.000000,-1.000000,0.000000
50%,22606.000000,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
60%,27127.000000,42.000000,701.000000,18.000000,223.000000,2.000000,-1.000000,0.000000
80%,36169.000000,51.000000,1859.000000,24.000000,368.000000,4.000000,-1.000000,0.000000
100%,45211.000000,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000
max,45211.000000,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [53]:
pd.cut(bank["age"],bins=4)

0          (56.5, 75.75]
1          (37.25, 56.5]
2        (17.923, 37.25]
3          (37.25, 56.5]
4        (17.923, 37.25]
              ...
45206      (37.25, 56.5]
45207      (56.5, 75.75]
45208      (56.5, 75.75]
45209      (56.5, 75.75]
45210    (17.923, 37.25]
Name: age, Length: 45211, dtype: category
Categories (4, interval[float64]): [(17.923, 37.25] < (37.25, 56.5] < (56.5, 75.75] < (75.75, 95.0]]

In [54]:
pd.cut(bank["age"],bins=4).value_counts()

(37.25, 56.5]      20680
(17.923, 37.25]    20409
(56.5, 75.75]       3861
(75.75, 95.0]        261
Name: age, dtype: int64

In [70]:
cut_bins = [0,40,60,90]
pd.DataFrame(pd.cut(bank["age"], bins=cut_bins).value_counts())

            age
(0, 40]   24717
(40, 60]  19306
(60, 90]   1181